{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_1", "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 32, 32, 1]}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "trainable": true, "gamma_constraint": null, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_2", "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "trainable": true, "gamma_constraint": null, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_3", "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "trainable": true, "gamma_constraint": null, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_4", "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "trainable": true, "gamma_constraint": null, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "seed": null, "rate": 0.25, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "trainable": true, "gamma_constraint": null, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "dense_1", "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "units": 512, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "trainable": true, "gamma_constraint": null, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "seed": null, "rate": 0.5, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "dense_2", "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "units": 11, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "softmax", "trainable": true}}]}}